[
  {
    "animal_name":"African Rock Python",
    "animal_common":"python",
    "animal_location":"Central Africa",
    "animal_info":"The African rock python lives in the tropical African savanna that stretches through Africa like a belt. At 30 ft. in length, it is the third largest snake in the world. The African rock python is the only large snake found on the African continent. It is very bulky and has a dark arrowhead shape on its head. Brown blotches outlined by black on tan background surround its body.They can get to be over 250 lbs."
  },
  {
    "animal_name":"African Zebra",
    "animal_common":"zebra",
    "animal_location":"East Africa",
    "animal_info":"Zebras, horses and wild asses are all equids, long-lived animals that move quickly for their large size and have teeth built for grinding and cropping grass. Zebras have horselike bodies, but their manes are made of short, erect hair, their tails are tufted at the tip and their coats are striped."
  },
  {
    "animal_name":"African Elephant",
    "animal_common":"elephant",
    "animal_location":"Central Africa",
    "animal_info":"The African elephant is the largest animal walking the Earth. Their herds wander through 37 countries in Africa. They are easily recognized by their trunk that is used for communication and handling objects. And their large ears allow them to radiate excess heat. Upper incisor teeth develop into tusks in African elephants and grow throughout their lifetime. There are two subspecies of African elephants—the Savanna (or bush) elephant and the Forest elephant. Savanna elephants are larger than forest elephants, and their tusks curve outwards."
  },
  {
    "animal_name":"African Cheetah",
    "animal_common":"cheetah",
    "animal_location":"South Africa",
    "animal_info":"The cheetah's habitat has been reduced by 76%, and they occur widely but sparsely in the regions they still inhabit. Southern and Eastern Africa are strongholds for cheetah populations."
  },
  {
    "animal_name":"Afican Bushbuck",
    "animal_common":"bushbuck",
    "animal_location":"East Africa",
    "animal_info":"he shy and elusive bushbuck is widely distributed over sub-Saharan Africa. In East Africa it is found in a variety of habitats, though rarely on open land. Bushbucks have a lot of individual and regional differences in their coat colors and patterns. As many as 40 varieties have been described. In general, bushbuck inhabiting deep forest have darker coats."
  },
  {
    "animal_name":"African Lion",
    "animal_common":"lion",
    "animal_location":"South Africa",
    "animal_info":"African lions can be found from the southern Sahara Desert down to southern Africa, excluding the Congo rain forest region. African lions inhabit grasslands and open woods. African lions can weigh up to 500 pounds. Males are larger than females and can be distinguished by their mane, which surrounds the head and extends down to the chest."
  },
  {
    "animal_name":"African Baboon",
    "animal_common":"baboon",
    "animal_location":"West Africa",
    "animal_info":"Baboons are found in surprisingly varied habitats and are extremely adaptable. They generally prefer semiarid habitats, like savannas, but some live in tropical forests. The major requirements for any habitat seem to be water sources and safe sleeping places—either in tall trees or on cliff faces."
  },
  {
    "animal_name":"Nile Crocodile",
    "animal_common":"crocodile",
    "animal_location":"East Africa",
    "animal_info":"One of the three species of crocodile found in Africa, the Nile crocodile is the second largest crocodile in the world, reaching a typical adult length of 5 metres (16.4 feet). The Nile crocodile is quite widespread throughout sub-Saharan Africa, the Nile Basin, and Madagascar in rivers, freshwater marshes, and mangrove swamps. On average the Nile crocodile is between 4 metres (13.1 feet) to 5 metres (16.4 feet), weighing around 410 kg (900 lb). However, specimens measuring 6 metres (19.6 feet) in length and weighing 900 kg (2,000 lb) are not uncommon."
  },
  {
    "animal_name":"Western Lowland Gorilla",
    "animal_common":"Gorilla",
    "animal_location":"Central Africa",
    "animal_info":"Western lowland gorillas are endangered, but they remain far more common than their relatives, the mountain gorillas. They live in heavy rain forests, and it is difficult for scientists to accurately estimate how many survive in Cameroon, Central African Republic, Congo, Equatorial Guinea, Gabon, Angola, and the Democratic Republic of Congo."
  }
]